README.md

# Table of Contents

1.  [ModuClip - ModuGen Polygon Clipper](#org71e4ca2)
    1.  [About](#org7dd86c0)
        1.  [Constraints](#orgbb617a1)
    2.  [Quickstart](#orgd337d0b)
        1.  [Deployment using Docker](#org7364583)
    3.  [Dependencies](#org2132367)
    4.  [Models](#org92f2e3d)


<a id="org71e4ca2"></a>

# ModuClip - ModuGen Polygon Clipper


<a id="org7dd86c0"></a>

## About

ModuClip is an API for [PolyClipper](polyclipper.py) - a 3D polygon clipping module.

Only clipping by plane is supported.


<a id="orgbb617a1"></a>

### Constraints

Polygon:

-   must be convex (see note)
-   must lie in XY plane

Plane

-   must be perpendicular to the polygon (see note)

Note: PolyClipper does not require polygon convexity nor polygon-plane orthogonality. 
Both constraints are implemented only inside API for the completeness of the coding challenge.


<a id="orgd337d0b"></a>

## Quickstart

Install dependencies:

    pip install -r requirements.txt

or for development:

    pip install -r requirements-dev.txt

Run the live server

    uvicorn moduclip:app --reload

Access interactive API docs: <http://localhost:8000/docs>

Run tests:

    pytest -k "not visual" 

or with clipping visualisations generated by `trimesh.viewer`:

    pytest

Check API docs or [`test_moduclip.py`](test_moduclip.py) for API request body examples.


<a id="org7364583"></a>

### Deployment using Docker

Build image:

    docker build -t <image_name> .

Create container:

    docker run -d --name <container_name> -p 8089:80 <image_name>

Access OpenAPI at <http://localhost:8089/docs>


<a id="org2132367"></a>

## Dependencies

PolyClipper depends on geometry processing libraries:

-   [trimesh](https://trimsh.org/index.html) (polygon clipping)
-   [shapely](https://shapely.readthedocs.io/en/stable/) (polygon convexity check)
-   [pydantic](https://docs.pydantic.dev/) (data validation)

ModuClip is built with [FastAPI](https://fastapi.tiangolo.com/).

Both PolyClipper and ModuClip rely on polygon and plane classes defined in [`models.py`](models.py)


<a id="org92f2e3d"></a>

## Models

Polygon and Plane classes are designed to be used seamlessly with js geometry processing libraries like
[three](https://threejs.org/) and [babylon](https://www.babylonjs.com/).

Check [`test_polyclipper.py`](test_polyclipper.py) for polygon and plane instance creation examples.

